test/src/test/testtool/WsdlGenerator/scenario01/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ns="http://nn.nl/XSD/Generic/MessageHeader/1">
	<soap:Header>
		<ns:MessageHeader>
			<ns:From>
				<ns:Id>Ibis4GI</ns:Id>
			</ns:From>
			<ns:To>
				<ns:Location>ESB.PropertyAndCasualtyRetail.TS.Vehicle.PropertyAndCasualtyRetailVehicle.1.FindVehicle.1.Request</ns:Location>
			</ns:To>
			<ns:HeaderFields>
				<ns:CPAId>n/a</ns:CPAId>
				<ns:ConversationId>cal-slcu1-144_ac11a84b-4cd4d6ea_135a5266a75_-7a97</ns:ConversationId>
				<ns:MessageId>cal-slcu1-144_ac11a84b-4cd4d6ea_135a5266a75_-7a96</ns:MessageId>
				<ns:Timestamp>2012-02-22T18:54:19</ns:Timestamp>
			</ns:HeaderFields>
			<ns:Service>
				<ns:Name>Vehicle</ns:Name>
				<ns:Context>PropertyAndCasualtyRetailVehicle</ns:Context>
				<ns:Action>
					<ns:Paradigm>Request</ns:Paradigm>
					<ns:Name>FindVehicle</ns:Name>
					<ns:Version>1</ns:Version>
				</ns:Action>
			</ns:Service>
		</ns:MessageHeader>
	</soap:Header>
	<soap:Body>
		<FindVehicleTypeREQ xmlns="http://nn.nl/XSD/PropertyAndCasualtyRetail/Vehicle/PropertyAndCasualtyRetailVehicle/1/FindVehicle/1">
			<Body>
				<bouwmnd>3</bouwmnd>
				<bouwjr>2008</bouwjr>
				<brandstof>B</brandstof>
				<hybride>J</hybride>
				<voertuigSoort>110</voertuigSoort>
			</Body>
		</FindVehicleTypeREQ>
	</soap:Body>
</soap:Envelope>
